using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Billboard : MonoBehaviour
{

//**********************************************************************
//
// データ
//
//**********************************************************************

	// メインカメラ
	GameObject main_camera_;



//**********************************************************************
//
// メソッド
//
//**********************************************************************

//################################################################################
//
// [ スタート関数	(Unityメインループ関数) ]
//
//################################################################################

	void Start()
	{
		main_camera_ = GameObject.Find("MainCamera");
	}


	
//################################################################################
//
// [ 更新関数(Unityメインループ関数) ]
//
//################################################################################

	void Update()
	{
		transform.LookAt (transform.position + main_camera_.transform.rotation * Vector3.back, main_camera_.transform.rotation * Vector3.down);
	}
}
