using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Billboard : MonoBehaviour
{

//**********************************************************************
//
// データ
//
//**********************************************************************

	// メインカメラ
	GameObject player_;



//**********************************************************************
//
// メソッド
//
//**********************************************************************

//################################################################################
//
// [ スタート関数	(Unityメインループ関数) ]
//
//################################################################################

	void Start()
	{
		player_ = GameObject.Find("Player");
	}


	
//################################################################################
//
// [ 更新関数(Unityメインループ関数) ]
//
//################################################################################

	void Update()
	{
		transform.LookAt (transform.position + player_.transform.rotation * Vector3.back, player_.transform.rotation * Vector3.down);
	}
}
